# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

lst = [1, 1, 2, 0, -1, 3, 4, 4]

newSet = set(lst)   # Превратить список во множесто
print(newSet)
print(len(newSet))




